<h1 style="color: red"> Data Preprocessing and Feature Enginearing</h1>

<h2 style="color: blue">Importing neccessary Module for Data Preprocessing</h2>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

<h2 style="color: blue"> AnalysingThe Data </h2>

In [2]:
# Opening The Excel File Using Pandas
df1 = pd.read_excel("customer_churn_large_dataset.xlsx")
df1.head()

,CustomerID,Name,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
0,1,Customer_1,63,Male,Los Angeles,17,73.36,236,0
1,2,Customer_2,62,Female,New York,1,48.76,172,0
2,3,Customer_3,24,Female,Los Angeles,5,85.47,460,0
3,4,Customer_4,36,Female,Miami,3,97.94,297,1
4,5,Customer_5,46,Female,Miami,19,58.14,266,0

In [3]:
# going through the Description Of the Data
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 9 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   CustomerID                  100000 non-null  int64
 1   Name                        100000 non-null  object
 2   Age                         100000 non-null  int64
 3   Gender                      100000 non-null  object
 4   Location                    100000 non-null  object
 5   Subscription_Length_Months  100000 non-null  int64
 6   Monthly_Bill                100000 non-null  float64
 7   Total_Usage_GB              100000 non-null  int64
 8   Churn                       100000 non-null  int64
dtypes: float64(1), int64(5), object(3)
memory usage: 6.9+ MB

In [4]:
# Number of Columns and there Name
df1.columns, len(df1.columns)

(Index(['CustomerID', 'Name', 'Age', 'Gender', 'Location',
        'Subscription_Length_Months', 'Monthly_Bill', 'Total_Usage_GB',
        'Churn'],
       dtype='object'),
 9)

In [5]:
# Number Of Rows
len(df1)

100000

In [6]:
df1.shape

(100000, 9)

In [7]:
# Number of Null Value In Each columns
df1.isnull().sum()

CustomerID                    0
Name                          0
Age                           0
Gender                        0
Location                      0
Subscription_Length_Months    0
Monthly_Bill                  0
Total_Usage_GB                0
Churn                         0
dtype: int64

We don't have any null values

In [8]:
# Let see How Many Unique Gender's We Have
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [9]:
# Let See How Many Unique Locations We Have
df1["Location"].unique()

array(['Los Angeles', 'New York', 'Miami', 'Chicago', 'Houston'],
      dtype=object)

In [10]:
# Let also see Subscription_Length_months feature
df1["Subscription_Length_Months"].unique(), df1["Subscription_Length_Months"].dtype

(array([17,  1,  5,  3, 19, 15, 10, 12, 20, 13,  8, 23,  2,  4, 18,  9, 14,
        16,  6,  7, 24, 22, 11, 21], dtype=int64),
 dtype('int64'))

In [11]:
# Also Exploring The Monthly Bill
df1["Monthly_Bill"].unique(), df1["Monthly_Bill"].dtype

(array([73.36, 48.76, 85.47, ..., 75.21, 41.98, 83.55]), dtype('float64'))

<h2 style="color: blue">Performing Some Operations</h2>

In [12]:
# Creating Another Data Frame By Deep Copying
df2 = df1.copy()
df2.head()

,CustomerID,Name,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
0,1,Customer_1,63,Male,Los Angeles,17,73.36,236,0
1,2,Customer_2,62,Female,New York,1,48.76,172,0
2,3,Customer_3,24,Female,Los Angeles,5,85.47,460,0
3,4,Customer_4,36,Female,Miami,3,97.94,297,1
4,5,Customer_5,46,Female,Miami,19,58.14,266,0

In [13]:
# Adding CustomerID as Index
df2.set_index("CustomerID", inplace=True)
df2.head()

,Name,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
CustomerID,,,,,,,,
1,Customer_1,63,Male,Los Angeles,17,73.36,236,0
2,Customer_2,62,Female,New York,1,48.76,172,0
3,Customer_3,24,Female,Los Angeles,5,85.47,460,0
4,Customer_4,36,Female,Miami,3,97.94,297,1
5,Customer_5,46,Female,Miami,19,58.14,266,0

In [14]:
# As we have Customer Id To Identify Each Person So We Don't Required Customer's Name
df3 = df2.drop("Name", axis="columns")
df3.head()

,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
CustomerID,,,,,,,
1,63,Male,Los Angeles,17,73.36,236,0
2,62,Female,New York,1,48.76,172,0
3,24,Female,Los Angeles,5,85.47,460,0
4,36,Female,Miami,3,97.94,297,1
5,46,Female,Miami,19,58.14,266,0

In [15]:
# Exploring The Age Column
df3[(df3["Age"]<18) | (df3["Age"]>80)]

Empty DataFrame
Columns: [Age, Gender, Location, Subscription_Length_Months, Monthly_Bill, Total_Usage_GB, Churn]
Index: []

So we can see that our Age feature is perfectly good so we don't required any operation on it

<h2 style="color: blue">Dealing With Gender Column</h2>

In [16]:
df4 = df3.copy()
df4.head()

,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn
CustomerID,,,,,,,
1,63,Male,Los Angeles,17,73.36,236,0
2,62,Female,New York,1,48.76,172,0
3,24,Female,Los Angeles,5,85.47,460,0
4,36,Female,Miami,3,97.94,297,1
5,46,Female,Miami,19,58.14,266,0

In [17]:
df4["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [18]:
dummy = pd.get_dummies(df4["Gender"])
dummy.head()

            Female  Male
CustomerID
1                0     1
2                1     0
3                1     0
4                1     0
5                1     0

In [19]:
df5 = pd.concat([df4, dummy.drop("Female", axis="columns")], axis="columns")
df5.head()

,Age,Gender,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn,Male
CustomerID,,,,,,,,
1,63,Male,Los Angeles,17,73.36,236,0,1
2,62,Female,New York,1,48.76,172,0,0
3,24,Female,Los Angeles,5,85.47,460,0,0
4,36,Female,Miami,3,97.94,297,1,0
5,46,Female,Miami,19,58.14,266,0,0

In [20]:
df5.drop("Gender", axis="columns", inplace=True)

In [21]:
df5.rename(columns={"Male":"Gender"}, inplace=True)

In [22]:
df5.head()
# Gender
# 0: Female
# 1: Male

,Age,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn,Gender
CustomerID,,,,,,,
1,63,Los Angeles,17,73.36,236,0,1
2,62,New York,1,48.76,172,0,0
3,24,Los Angeles,5,85.47,460,0,0
4,36,Miami,3,97.94,297,1,0
5,46,Miami,19,58.14,266,0,0

<h2 style="color: blue">Dealing With Location Column</h2>

In [23]:
df6 = df5.copy()
df6.head()

,Age,Location,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn,Gender
CustomerID,,,,,,,
1,63,Los Angeles,17,73.36,236,0,1
2,62,New York,1,48.76,172,0,0
3,24,Los Angeles,5,85.47,460,0,0
4,36,Miami,3,97.94,297,1,0
5,46,Miami,19,58.14,266,0,0

In [24]:
df6["Location"].unique()

array(['Los Angeles', 'New York', 'Miami', 'Chicago', 'Houston'],
      dtype=object)

In [25]:
# Checking Number Of Data In Each Location
df6.groupby("Location")["Location"].agg("count")

Location
Chicago        19958
Houston        20157
Los Angeles    20041
Miami          20031
New York       19813
Name: Location, dtype: int64

For Dealing With This We Will Create A Single Column

In [26]:
mapping_dc = {}
for idx, location in enumerate(df6["Location"].unique()):
    mapping_dc[location] = idx
    
mapping_dc

{'Los Angeles': 0, 'New York': 1, 'Miami': 2, 'Chicago': 3, 'Houston': 4}

In [27]:
temp = df6.copy()

In [28]:
locations = temp["Location"].apply(lambda x: mapping_dc[x])
locations

CustomerID
1         0
2         1
3         0
4         2
5         2
         ..
99996     4
99997     1
99998     3
99999     1
100000    0
Name: Location, Length: 100000, dtype: int64

In [29]:
df6.drop(columns="Location", inplace=True)

In [30]:
df6["Location"] = locations

In [31]:
df6.head()

,Age,Subscription_Length_Months,Monthly_Bill,Total_Usage_GB,Churn,Gender,Location
CustomerID,,,,,,,
1,63,17,73.36,236,0,1,0
2,62,1,48.76,172,0,0,1
3,24,5,85.47,460,0,0,0
4,36,3,97.94,297,1,0,2
5,46,19,58.14,266,0,0,2

In [33]:
df6.to_excel("Processed_Customer_Data.xlsx")